[
  {
    "title": "Amazon Interview Experience (Off-Campus)",
    "body": "Hi Everyone,As the title mentions, I belong to the tier 3 mechanical branch luckily joined Infosys last year. After joining I gained a lot of interest in CS. I started by picking Java",
    "link": "https://www.geeksforgeeks.org/amazon-interview-experience-off-campus/"
  },
  {
    "title": "MicroSoft Interview Experience for SDE-1",
    "body": "During my B.tech, our seniors informed us how important DSA is to crack placements. Therefore, I started practicing DSA from GeeksFromGeeks, Leetcode,,",
    "link": "https://www.geeksforgeeks.org/microsoft-interview-experience-for-sde-1-3/"
  },
  {
    "title": "On-Campus Interview Experience of companies like UBER, Directi, DE-Shaw, Microsoft",
    "body": "I decided to write this article to help my fellow juniors with there interviews. I am not saying everything which I write in this article is necessarily true. This is just based on my experience",
    "link": "https://www.geeksforgeeks.org/on-campus-interview-experience-of-companies-like-uber-directi-de-shaw-microsoft/"
  },
  {
    "title": "Adobe SheCodes Interview Experience for Product Intern(2022)",
    "body": "In this blog, I’ll share my interview experience for the role of Adobe – Product Intern(2022) for which I got an interview opportunity through the shecodes initiative",
    "link": "https://www.geeksforgeeks.org/adobe-shecodes-interview-experience-for-product-intern2022/"
  },
  {
    "title": "7 Best Analytical Skills to Include on Your Resume",
    "body": "As the competition in the job market is rising rapidly, you’re required to possess some extra skills or learnings to grab the attention of recruiters. Meanwhile, one of the most",
    "link": "https://www.geeksforgeeks.org/analytical-skills/"
  },
  {
    "title": "12 Best Resume Do’s and Don’ts Tips in 2023",
    "body": "Indeed, a worthwhile and impactful resume is a must for all individuals while looking out for a job opportunity. Your resume acts as a marketing tool for you that showcase your",
    "link": "https://www.geeksforgeeks.org/best-resume-dos-and-donts-tips-in-2023/"
  },
  {
    "title": "20+ Tips To Get Your Resume Shortlisted For Top Tech Companies",
    "body": "A lot of students and professionals, like you, have a dream to get into big tech companies like Meta, Microsoft, Amazon, Alphabet, Netflix, and Google",
    "link": "https://www.geeksforgeeks.org/get-your-resume-shortlisted-for-top-tech-companies/"
  },
  {
    "title": "How to Answer “Tell Me About Yourself” in an Interview?",
    "body": "Regardless of any job profile or any company – ‘Tell Me About Yourself’, it is undeniably the very first question that you often face in every interview. The question gives you the",
    "link": "https://www.geeksforgeeks.org/how-to-answer-tell-me-about-yourself-in-an-interview/"
  },
  {
    "title": "How to Answer “Why Should We Hire You” in an Interview?",
    "body": "“Why Should We Hire You?” – Doesn’t matter how confident you’re on your knowledge and skillset during an interview, when the interviewer asks this simple yet prominent",
    "link": "https://www.geeksforgeeks.org/how-to-answer-why-should-we-hire-you-in-an-interview/"
  },
  {
    "title": "How to Answer “What are Your Strengths and Weaknesses” in an Interview?",
    "body": "During a job interview, when candidates are asked – “What are your Strengths and Weaknesses”, most of the time they either opt to become too humble while",
    "link": "https://www.geeksforgeeks.org/how-to-answer-what-are-your-strengths-and-weaknesses-in-an-interview/"
  }
]